docs(lib-network-protocol): use mermaid diagram on protocol readme.md
